#include <stdio.h>

int main() {
    // Ціле число
    int num = 255;
    
    // Виведення в різних форматах
    printf("Ціле число в десятковій системі: %d\n", num);
    printf("Ціле число у двійковій системі: %s\n", "11111111");  // Статичний двійковий вигляд для прикладу
    printf("Ціле число у вісімковій системі: %o\n", num);
    printf("Ціле число у шістнадцятковій системі: %x\n", num);
    
    // Дійсне число
    double realNum = 123.456;

    // Виведення дійсного числа в різних форматах
    printf("Дійсне число з плаваючою комою: %f\n", realNum);
    printf("Дійсне число в експоненційній формі: %e\n", realNum);
    printf("Дійсне число в гнучкій формі: %g\n", realNum);

    // Символ і стрічка
    char ch = 'A';
    char str[] = "Hello, World!";
    printf("Символ: %c\n", ch);
    printf("Рядок: %s\n", str);
    return 0;
}
